/****************************************************************************
* 文 件 名: main.c
* 作    者: Andy
* 修    订: 2013-01-08
* 版    本: 1.0
* 描    述: 通过按键S1产生外部中断改变LED1、LED2、LED3执行倒序流水灯
****************************************************************************/
#include <ioCC2530.h>

typedef unsigned char uchar;
typedef unsigned int  uint;

#define LED1 P1_0       //定义P1.0口为LED1控制端
#define LED2 P1_1       //定义P1.1口为LED2控制端
#define LED3 P1_4       //定义P1.4口为LED3控制端
#define KEY1 P0_1       //定义P0.1口为S1控制端


uchar KeyValue=0;

/****************************************************************************
* 名    称: DelayMS()
* 功    能: 以毫秒为单位延时 16M时大约为530,系统时钟不修改默认为16M
* 入口参数: msec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayMS(uint msec)
{ 
    uint i,j;
    
    for (i=0; i<msec; i++)
        for (j=0; j<530; j++);
}

/****************************************************************************
* 名    称: LedOnOrOff()
* 功    能: 点亮或熄灭所有LED灯    
* 入口参数: mode为0时LED灯亮  mode为1时LED灯灭
* 出口参数: 无
****************************************************************************/
void LedOnOrOff(uchar mode)
{
    LED1 = mode;
    LED2 = mode;
    LED3 = mode; //由于P1.4与仿真器共用,必须拔掉仿真器的插头才能看到LED3的变化
}

/****************************************************************************
* 名    称: InitLed()
* 功    能: 设置LED灯相应的IO口
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitLed(void)
{
    P1DIR |= 0x13;         //P1.0、P1.1、P1.4定义为输出
    LedOnOrOff(1);         //使所有LED灯默认为熄灭状态
}

/****************************************************************************
* 名    称: InitKey()
* 功    能: 设置KEY相应的IO口，采用中断方式 
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitKey()
{
    P0IEN |= 0x2;          // P0.1 设置为中断方式 1：中断使能
    PICTL |= 0x1;          //下降沿触发   
    IEN1 |= 0x20;          //允许P0口中断; 
    P0IFG = 0x00;         //初始化中断标志位
    EA = 1;                   //打开中断
}

/****************************************************************************
* 名    称: P0_ISR(void) 中断处理函数 
* 描    述: #pragma vector = 中断向量，紧接着是中断处理程序
****************************************************************************/
#pragma vector = P0INT_VECTOR    
__interrupt void P0_ISR(void) 
{ 
    if(P0IFG > 0)          //按键中断
    {
        DelayMS(10);       //延时去抖       
        if(P0IFG > 0)      //按键中断
        {
            KeyValue = 1;  //产生中断保存中断状态
        }  
    } 
    
    P0IFG = 0;             //清中断标志
    P0IF = 0;              //清端口0中断标志
} 

/****************************************************************************
* 程序入口函数
****************************************************************************/
void main(void)
{
    InitLed();             //设置LED灯相应的IO口
    InitKey();             //设置KEY相应的IO口
    
    while(1)
    {
        if(KeyValue == 1)   //如果按键按下LED3、LED2、LED1将倒序流水灯闪烁 
        {
            LED3 = !LED3;         
            DelayMS(200); 
            LED2 = !LED2;         
            DelayMS(200);            
            LED1 = !LED1;         
            DelayMS(200);
            KeyValue = 0;
        }
    }
}
