/****************************************************************************
* 文 件 名: main.c
* 作    者: Andy
* 修    订: 2013-01-08
* 版    本: 1.0
* 描    述: 按下按键S1控制LED1灯亮和灭
****************************************************************************/
#include <ioCC2530.h>

typedef unsigned char uchar;
typedef unsigned int  uint;

#define LED1 P1_0       // P1.0口控制LED1
#define LED2 P1_1  
#define LED3 P1_2  
#define LED4 P1_3  
#define LED5 P1_4  
#define LED6 P1_5  
#define LED7 P1_6 
#define LED8 P1_7  

#define KEY1 P0_0       // P0.1口控制S1
#define KEY2 P0_1
#define KEY3 P0_2
#define KEY4 P0_3
#define KEY5 P0_4
#define KEY6 P0_5
#define KEY7 P0_6
#define KEY8 P0_7
/****************************************************************************
* 名    称: DelayMS()
* 功    能: 以毫秒为单位延时，系统时钟不配置时默认为16M(用示波器测量相当精确)
* 入口参数: msec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayMS(uint msec)
{ 
    uint i,j;
    
    for (i=0; i<msec; i++)
        for (j=0; j<535; j++);
}

/****************************************************************************
* 名    称: InitLed()
* 功    能: 设置LED相应的IO口
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitLed(void)
{
    P1DIR |= 0xff;      // P1.0定义为输出
    LED1 = 1;           // LED1灯熄灭 
    LED2 = 1;           // LED1灯熄灭
    LED3 = 1;
    LED4 = 1; 
    LED5 = 1; 
    LED6 = 1; 
    LED7 = 1;
    LED8 = 1; 
}

/****************************************************************************
* 名    称: InitKey()
* 功    能: 设置按键相应的IO口
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitKey(void)
{
    P0SEL &= ~0xff;     //设置P0.1为普通IO口  
    P0DIR &= ~0xff;     //按键接在P0.1口上，设P0.1为输入模式 
    P0INP &= ~0xff;     //打开P0.1上拉电阻
}

/****************************************************************************
* 名    称: KeyScan()
* 功    能: 读取按键状态
* 入口参数: 无
* 出口参数: 0为抬起   1为按键按下
****************************************************************************/
/*uchar KeyScan(void)
{
    if (KEY1 == 1)
    {
        DelayMS(0);
        if (KEY1 == 1)
        {
            while(!KEY1); //松手检测
            return 0;     //有按键按下
        }
    }
    
    return 1;             //无按键按下
}
*/
/****************************************************************************
* 程序入口函数
****************************************************************************/
void main(void)
{
    InitLed();		      //设置LED1相应的IO口
    InitKey();            //设置S1相应的IO口
    while(1)
    {
            if(KEY1==0)
            {
             DelayMS(50);
              LED1=0;
            }
            else
            {
             DelayMS(50);
              LED1=1;
            }
             if(KEY2==0)
             {
             DelayMS(50);
              LED2=0;
            }
            else
            {
             DelayMS(50);
              LED2=1;
            }
            if(KEY3==0)
            {
             DelayMS(50);
              LED3=0;
            }
            else
            {
             DelayMS(50);
              LED3=1;
            }
            if(KEY4==0)
            {
             DelayMS(50);
              LED4=0;
            }
            else
            {
             DelayMS(50);
              LED4=1;
            }
            if(KEY5==0)
            {
             DelayMS(50);
              LED5=0;
            }
            else
            {
             DelayMS(50);
              LED5=1;
            }
            if(KEY6==0)
            {
             DelayMS(50);
              LED6=0;
            }
            else
            {
             DelayMS(50);
              LED6=1;
            }
            if(KEY7==0)
            {
             DelayMS(50);
              LED7=0;
            }
            else
            {
             DelayMS(50);
              LED7=1;
            }
            if(KEY8==0)
            {
             DelayMS(50);
              LED8=0;
            }
            else
            {
             DelayMS(50);
              LED8=1;
            }
     }
}
