/****************************************************************************
* 文 件 名: main.c
* 作    者: Andy
* 修    订: 2013-01-08
* 版    本: 1.0
* 描    述: 操作IO口控制3盏LED灯的全亮和全灭、闪烁、流水灯
****************************************************************************/
#include <ioCC2530.h>

typedef unsigned char uchar;
typedef unsigned int  uint;

#define LED1 P1_0       //定义P1.0口为LED1控制端
#define LED2 P1_1       //定义P1.1口为LED2控制端
#define LED3 P1_2       //定义P1.4口为LED3控制端
#define LED4 P1_3
#define LED5 P1_4
#define LED6 P1_5
#define LED7 P1_6
#define LED8 P1_7


/****************************************************************************
* 名    称: DelayMS()
* 功    能: 以毫秒为单位延时，系统时钟不配置时默认为16M(用示波器测量相当精确)
* 入口参数: msec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayMS(uint msec)
{ 
    uint i,j;
    
    for (i=0; i<msec; i++)
        for (j=0; j<535; j++);
}

/****************************************************************************
* 名    称: LedOnOrOff()
* 功    能: 点亮或熄灭所有LED灯    
* 入口参数: mode为0时LED灯亮  mode为1时LED灯灭
* 出口参数: 无
****************************************************************************/
void LedOnOrOff(uchar mode)
{
    LED1 = mode;
    LED2 = mode;
    LED3 = mode; //由于P1.4与仿真器共用,必须拔掉仿真器的插头才能看到LED3的变化
    LED4 = mode;
    LED5 = mode;
    LED6 = mode;
    LED7 = mode;
    LED8 = mode;
}

/****************************************************************************
* 名    称: InitLed()
* 功    能: 设置LED灯相应的IO口
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitLed(void)
{
    P1DIR |= 0xff;      //P1.0、P1.1、P1.4定义为输出
    LedOnOrOff(1);      //使所有LED灯默认为熄灭状态
}

/****************************************************************************
* 程序入口函数
****************************************************************************/
void main(void)
{
    uchar i;
    
    InitLed();               //设置LED灯相关IO口
    
    while(1)                 //死循环
    {  
        LED1 = !LED1;         //流水灯，初始化时LED为熄灭执行后则点亮
        DelayMS(200);         
        LED2 = !LED2;         
        DelayMS(200);            
        LED3 = !LED3;        
        DelayMS(200);   
        LED4 = !LED4;        
        DelayMS(200);
        LED5 = !LED5;        
        DelayMS(200);
        LED6 = !LED6;        
        DelayMS(200);
        LED7 = !LED7;        
        DelayMS(200);
        LED8 = !LED8;        
        DelayMS(200);     
        
        for (i=0; i<3; i++)  //所有灯闪烁2次
        {
           LedOnOrOff(1);    //关闭所有LED灯
           DelayMS(200);
           LedOnOrOff(0);    //打开所有LED灯
           DelayMS(200);
        }
        
        LedOnOrOff(1);       //使所有LED灯熄灭状态
        DelayMS(500);
    }
}
